# in the name God

#__new__

#در پایتون متد نیو مسئول ساخت یک کلاس جدید است
#متد نیو تنها متدی هستش که قبل از متد اینیت اجرا میشود و میتواند مانع اجرا شدن اینیت شود
#متد نیو کانستراکتور یا همان ایجاد کننده یک کلاس میباشد


class A:
    def __init__(self, name):
        self.name=name
    def __new__(cls,name, *args, **kwargs):
        if name == "mojtaba" :  #if name equle Mojtaba class not creat
            return None
        else:
            return super().__new__(cls,*args,**kwargs)

# a=A('mojtaba')   #کلاس ایجاد نشد چون من نام مجتبی را به آن دادم

a= A('amir')
print(a)
print(a.__class__)    #شما از چه کلاسی ساخته شده ای
print(a.__class__.__class__)   #کلاس بالاتر از کلاس  کدام است که  جواب همان کلاس  والد تایپ میباشد

#در مثال بالا مقدار مچتبی اگر ارسال شود حتی اینشیال هم اجرا نمیشود
#هر گاه یک نمونه از کلاس ساخته میشود ابتدا  متد نیو فعال شده و یک نمونه را به متد نیوی ایجاد کننده خود میفرستد
#بعد از ارسال به کلاس میتوان از ان استفاده های مورد نیاز را کرد و بعد از ان اینیشیال اجرا میشود