#in the name of God

#stub file  you must read this file next annotation

""" ما هنگاامی که میخواهیم انوتیشن ها رو در یک فایل دیگه قرار بدهیم بجث استاب فایلها ایجاد میشه
ما هم نام همان فایل یک فایل جدید ایجاد میکنیم با پسوند پی وای ای و باید دقت کنیم که در همان دایرکتوری باشد"""

#وجود یک ستاره در کنار عبارت هدر فانکشن یعنی این یک فایل استاب دارد که انوتیشن ها در ان ذخیره شده  است

#اگر یک فانکشن ما چندین حالت مختلف در خروجی داشته باشد مثلا هم خروجی عدد باشد هم استرینگ ما میتوانیم از از اورلود استفاده کنیم

def show ( name , age ):
    return f' {name} is {age } old'
print(show('mojtaba',34))



#mypy :یک سامانه اینترنتی که میاید کد ما را اعتبار سنجی میکند 